---
type: RouteAnalysisSettings
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 11
tags: [revit-api, class]
---

# RouteAnalysisSettings

`Autodesk.Revit.DB.Analysis.RouteAnalysisSettings` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetExcludedCategoryIds | 2020 | `public ICollection < ElementId > GetExcludedCategoryIds ()` |
| Method | GetIgnoredCategoryIds | 2020 | `public ICollection < ElementId > GetIgnoredCategoryIds ()` |
| Method | GetRouteAnalysisSettings | 2020 | `public static RouteAnalysisSettings GetRouteAnalysisSettings ( Document cda )` |
| Method | IsLargeGeometryAllowed | 2020 | `public bool IsLargeGeometryAllowed ()` |
| Method | SetIgnoredCategoryIds | 2020 | `public void SetIgnoredCategoryIds ( ICollection < ElementId > categoryIds )` |
| Property | AnalysisZoneBottomOffset | 2020 | `public double AnalysisZoneBottomOffset { get ; set ; }` |
| Property | AnalysisZoneTopOffset | 2020 | `public double AnalysisZoneTopOffset { get ; set ; }` |
| Property | EnableIgnoredCategoryIds | 2020 | `public bool EnableIgnoredCategoryIds { get ; set ; }` |
| Property | IgnoreImports | 2020 | `public bool IgnoreImports { get ; set ; }` |
| Property | MinimumLength | 2020 | `public double MinimumLength { get ; }` |
| Property | Parameter | — | `` |